"""
В фермерском хозяйстве в Карелии выращивают чернику. Черника растет на круглой грядке, и кусты черники 
высажены по окружности грядки. Каждый куст черники имеет урожайность, которая соответствует количеству 
ягод на этом кусте. 
Урожайность черничных кустов представлена в виде списка arr, где arr[i] - это урожайность (количество 
ягод) i-го куста.
В фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего 
модуля и нескольких собирающих модулей. Каждый собирающий модуль может собрать ягоды с одного куста и с 
двух соседних кустов. Собирающий модуль находится перед определенным кустом, и он может выбирать, 
с какого куста начать сбор ягод.
Ваша задача - написать программу, которая определит максимальное число ягод, которое может собрать один 
собирающий модуль за один заход, находясь перед некоторым кустом грядки.
Входные данные:
На вход программе подается список arr, где arr[i] (1 ≤ arr[i] ≤ 1000) - урожайность i-го куста черники. 
Размер списка не превышает 1000 элементов.
Выходные данные:
Программа должна вывести одно целое число - максимальное количество ягод, которое может собрать собирающий 
модуль, находясь перед некоторым кустом грядки.

Пример использования 
На входе:
arr = [5, 8, 6, 4, 9, 2, 7, 3]
На выходе:
19
"""

"""
подсказка: Кусты располагаются по окружности. Это значит если собирающий модуль будет находиться 
на последнем кусте, то он сможет собрать ягоды с последнего куста, предпоследнего и первого.
"""

arr = [2, 4, 10, 4, 2]

# arr_count = list()
# for i in range(len(arr) - 1):
#     arr_count.append(arr[i - 1] + arr[i] + arr[i + 1])
# arr_count.append(arr[-2] + arr[-1] + arr[0])

# print(max(arr_count))

# collect = []
# for el in range(len(arr)):
    
#     if el == arr[0]:  # первый элемент в списке
#         collect.append(arr[0] + arr[1] + arr[-1])
#     elif el == arr[-1]:  # последний элемент в списке
#         collect.append(arr[-1] + arr[-2] + arr[0])
#     else:
#         collect.append(arr[el - 1] + arr[el] + arr[el + 1])
# print(max(collect))

collect = []
for el in range(len(arr) - 1):
    
    if el == arr[0]:  # первый элемент в списке
        collect.append(arr[0] + arr[1] + arr[-1])
    elif el == arr[-1]:  # последний элемент в списке
        collect.append(arr[-1] + arr[-2] + arr[0])
    else:
        collect.append(arr[el - 1] + arr[el] + arr[el + 1])
print(max(collect))


"""
В идеальном решении?
-1 от длины списка потому что в следующей строчке используется i-1 (левее i), i и i+1(правее i). 
И в случае прохождения for по всей длине цикла в последней итерации, где i = последнее число списка, 
i+1 выходит за пределы.
"""


# result = 0
# for i in range(1, len(arr) - 1):
#     equally = arr[i - 1] + arr[i] + arr[i + 1]
#     if equally > result:
#         result = equally
# print(result)